[
	{
		"Title": "CRQueue",
		"Link": "https://chrome.google.com/webstore/detail/crqueue/jelkmjpmjjlkhinmcipghbgkcdelldjj",
		"LinkText": "chrome.google.com/webstore/...",
		"Image": "CRQ.jpg",
		"DescriptionArr": [
			"A Chrome extension that allows you to view your CrunchyRoll queue from any tab using a Material UI theme.",
			"Features include updating your queue through unfocused tab manipulation, and redirects to facilitate login."
		],
		"Span": "Built as a solo personal project using pure JavaScript to manipulate the HTML and CSS.",
		"Contributions": ""
	},
	{
		"Title": "WoW Bindings",
		"Link": "https://wow-bindings.firebaseapp.com/",
		"LinkText": "wow-bindings.firebaseapp.com",
		"Image": "WoW.jpg",
		"DescriptionArr": [
			"A web app that allows you to test your World of Warcraft keybindings and trains your muscle memory for quick reactions.",
			"WoW Bindings was designed to be maintained with current abilities through the Google Sheets page it uses as a database."
		],
		"Span": "Built as a solo personal project using React for the front-end and draws from Google Sheets for the database used along with local storage.",
		"Contributions": ""
	},
	{
		"Title": "RezRight",
		"Link": "https://rezright.app/",
		"LinkText": "RezRight.app",
		"Image": "rezRight.jpg",
		"DescriptionArr": [
			"A web app that makes the process of creating a resume as easy as possible.",
			"RezRight was built using React for the front-end and Express.js with MongoDB for the back-end server and database."
		],
		"Span": "Developed on a team of four and deployed within 4 weeks.",
		"Contributions": "Individually contributed React structure, data structure storage development, front-end data flow."
	},
	{
		"Title": "Cloud Chart",
		"Link": "https://cloud-chart-java.firebaseapp.com/",
		"LinkText": "cloud-chart-java.firebaseapp.com",
		"Image": "CloudChart.jpg",
		"DescriptionArr": [
			"Cloud Chart is a spreadsheet-database hybrid, Spreadsheets are saved to a SQL database with cross referenced fields.",
			"Cloud Chart was built using React for the front-end, Java with Spring Boot for the back-end and MySQL for the database."
		],
		"Span": "Developed on a team of 3 and deployed within 1 week.",
		"Contributions": "Individually contributed React structure, front-end data flow and configured client RESTful endpoints."
	},
	{
		"Title": "Portfolio",
		"Link": "https://cruisebrantley.com/",
		"LinkText": "cruisebrantley.com",
		"Image": "portfolio.jpg",
		"DescriptionArr": [
			"This portfolio itself is a project. It was built using React, with CSS transitions - implemented with dynamic class changing, and hosted using Firebase",
			"Built to be fully Responsive to all screen sizes."
		],
		"Span": "Solo Project built in spare time.",
		"Contributions": ""
	}
]
